{"class_name": "Model", "config": {"name": "model_1", "layers": [{"name": "the_input", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 778, 26], "dtype": "float32", "sparse": false, "name": "the_input"}, "inbound_nodes": []}, {"name": "fc1", "class_name": "Dense", "config": {"name": "fc1", "trainable": true, "units": 2048, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["the_input", 0, 0, {}]]]}, {"name": "fc2", "class_name": "Dense", "config": {"name": "fc2", "trainable": true, "units": 2048, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["fc1", 0, 0, {}]]]}, {"name": "fc3", "class_name": "Dense", "config": {"name": "fc3", "trainable": true, "units": 2048, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["fc2", 0, 0, {}]]]}, {"name": "rnn_f", "class_name": "SimpleRNN", "config": {"name": "rnn_f", "trainable": true, "return_sequences": true, "go_backwards": false, "stateful": false, "unroll": false, "implementation": 0, "units": 512, "activation": "tanh", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.0, "recurrent_dropout": 0.0}, "inbound_nodes": [[["fc3", 0, 0, {}]]]}, {"name": "rnn_b", "class_name": "SimpleRNN", "config": {"name": "rnn_b", "trainable": true, "return_sequences": true, "go_backwards": true, "stateful": false, "unroll": false, "implementation": 0, "units": 512, "activation": "tanh", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.0, "recurrent_dropout": 0.0}, "inbound_nodes": [[["fc3", 0, 0, {}]]]}, {"name": "add_1", "class_name": "Add", "config": {"name": "add_1", "trainable": true}, "inbound_nodes": [[["rnn_f", 0, 0, {}], ["rnn_b", 0, 0, {}]]]}, {"name": "birelu", "class_name": "Activation", "config": {"name": "birelu", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["add_1", 0, 0, {}]]]}, {"name": "fc5", "class_name": "Dense", "config": {"name": "fc5", "trainable": true, "units": 2048, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["birelu", 0, 0, {}]]]}, {"name": "the_labels", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 80], "dtype": "float32", "sparse": false, "name": "the_labels"}, "inbound_nodes": []}, {"name": "input_length", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "int64", "sparse": false, "name": "input_length"}, "inbound_nodes": []}, {"name": "label_length", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "int64", "sparse": false, "name": "label_length"}, "inbound_nodes": []}, {"name": "ctc", "class_name": "Lambda", "config": {"name": "ctc", "trainable": true, "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0005\u0000\u0000\u0000\u0005\u0000\u0000\u0000C\u0000\u0000\u0000sD\u0000\u0000\u0000|\u0000\\\u0004}\u0001}\u0002}\u0003}\u0004t\u0000|\u0002j\u0001\u0083\u0001\u0001\u0000t\u0000|\u0001j\u0001\u0083\u0001\u0001\u0000t\u0000|\u0003j\u0001\u0083\u0001\u0001\u0000t\u0000|\u0004j\u0001\u0083\u0001\u0001\u0000t\u0002j\u0003|\u0002|\u0001|\u0003|\u0004\u0083\u0004S\u0000)\u0001N)\u0004\u00da\u0005print\u00da\u0005shape\u00da\u0001K\u00da\u000ectc_batch_cost)\u0005\u00da\u0004args\u00da\u0006y_pred\u00da\u0006labels\u00da\finput_length\u00da\flabel_length\u00a9\u0000r\n\u0000\u0000\u0000\u00fa1/cluster/project2/darkspeech/rob/kDS/run-train.py\u00da\u000fctc_lambda_func\u0084\u0001\u0000\u0000s\f\u0000\u0000\u0000\u0000\u0001\f\u0006\n\u0001\n\u0001\n\u0001\n\u0007", null, null], "function_type": "lambda", "output_shape": [1], "output_shape_type": "raw", "arguments": {}}, "inbound_nodes": [[["fc5", 0, 0, {}], ["the_labels", 0, 0, {}], ["input_length", 0, 0, {}], ["label_length", 0, 0, {}]]]}], "input_layers": [["the_input", 0, 0], ["the_labels", 0, 0], ["input_length", 0, 0], ["label_length", 0, 0]], "output_layers": [["ctc", 0, 0]]}, "keras_version": "2.0.4", "backend": "tensorflow"}