0
test script test-tf
Device mapping:
/job:localhost/replica:0/task:0/gpu:0 -> device: 0, name: Tesla P100-PCIE-16GB, pci bus id: 0000:02:00.0
MatMul: (MatMul): /job:localhost/replica:0/task:0/gpu:0
b: (Const): /job:localhost/replica:0/task:0/gpu:0
a: (Const): /job:localhost/replica:0/task:0/gpu:0
[[ 22.  28.]
 [ 49.  64.]]

 8192 x 8192 matmul took: 0.12 sec, 8875.83 G ops/sec
starting kDS script
2.0.4
6300
(4620, 840, 840)
('max_trans_charlength:', 80)
('Words:', 54198)
('Vocab:', 6145)
80
30
(?, 80)
(?, 778, 30)
(?, 1)
(?, 1)
________________________________________________________________________________
Layer (type)              Output Shape      Param #  Connected to               
================================================================================
the_input (InputLayer)    (None, 778, 26)   0                                   
________________________________________________________________________________
dropout_1 (Dropout)       (None, 778, 26)   0        the_input[0][0]            
________________________________________________________________________________
fc1 (Dense)               (None, 778, 2048) 55296    dropout_1[0][0]            
________________________________________________________________________________
dropout_2 (Dropout)       (None, 778, 2048) 0        fc1[0][0]                  
________________________________________________________________________________
fc2 (Dense)               (None, 778, 2048) 4196352  dropout_2[0][0]            
________________________________________________________________________________
dropout_3 (Dropout)       (None, 778, 2048) 0        fc2[0][0]                  
________________________________________________________________________________
fc3 (Dense)               (None, 778, 2048) 4196352  dropout_3[0][0]            
________________________________________________________________________________
dropout_4 (Dropout)       (None, 778, 2048) 0        fc3[0][0]                  
________________________________________________________________________________
rnn_f (SimpleRNN)         (None, 778, 512)  1311232  dropout_4[0][0]            
________________________________________________________________________________
rnn_b (SimpleRNN)         (None, 778, 512)  1311232  dropout_4[0][0]            
________________________________________________________________________________
concatenate_1 (Concatenat (None, 778, 1024) 0        rnn_f[0][0]                
                                                     rnn_b[0][0]                
________________________________________________________________________________
dropout_5 (Dropout)       (None, 778, 1024) 0        concatenate_1[0][0]        
________________________________________________________________________________
time_distributed_1 (TimeD (None, 778, 30)   30750    dropout_5[0][0]            
________________________________________________________________________________
the_labels (InputLayer)   (None, 80)        0                                   
________________________________________________________________________________
input_length (InputLayer) (None, 1)         0                                   
________________________________________________________________________________
label_length (InputLayer) (None, 1)         0                                   
________________________________________________________________________________
ctc (Lambda)              (None, 1)         0        time_distributed_1[0][0]   
                                                     the_labels[0][0]           
                                                     input_length[0][0]         
                                                     label_length[0][0]         
================================================================================
Total params: 11,101,214
Trainable params: 11,101,214
Non-trainable params: 0
________________________________________________________________________________
None
(288, 26)
train begin
train begin
on epoch begin
on epoch begin
Epoch 1/500
  1/288 [..............................] - ETA: 1394s - loss: 2304.1279  2/288 [..............................] - ETA: 766s - loss: 2186.7546   3/288 [..............................] - ETA: 558s - loss: 1835.4634  4/288 [..............................] - ETA: 451s - loss: 1457.1363  5/288 [..............................] - ETA: 386s - loss: 1211.4585  6/288 [..............................] - ETA: 346s - loss: 1026.9472  7/288 [..............................] - ETA: 315s - loss: 895.2536   8/288 [..............................] - ETA: 292s - loss: 811.2410  9/288 [..............................] - ETA: 273s - loss: 734.1990 10/288 [>.............................] - ETA: 259s - loss: 678.8140 11/288 [>.............................] - ETA: 247s - loss: 634.1787 12/288 [>.............................] - ETA: 237s - loss: 599.3114 13/288 [>.............................] - ETA: 228s - loss: 563.4088 14/288 [>.............................] - ETA: 221s - loss: 536.8302 15/288 [>.............................] - ETA: 214s - loss: 507.9867 16/288 [>.............................] - ETA: 209s - loss: 485.4591 17/288 [>.............................] - ETA: 204s - loss: 464.3907 18/288 [>.............................] - ETA: 199s - loss: 445.9233 19/288 [>.............................] - ETA: 195s - loss: 429.2773 20/288 [=>............................] - ETA: 191s - loss: 414.3660 21/288 [=>............................] - ETA: 187s - loss: 401.3515 22/288 [=>............................] - ETA: 184s - loss: 389.5363 23/288 [=>............................] - ETA: 181s - loss: 377.8936 24/288 [=>............................] - ETA: 178s - loss: 367.8638 25/288 [=>............................] - ETA: 176s - loss: 358.9292 26/288 [=>............................] - ETA: 174s - loss: 349.5994 27/288 [=>............................] - ETA: 171s - loss: 341.9301 28/288 [=>............................] - ETA: 169s - loss: 334.5163 29/288 [==>...........................] - ETA: 167s - loss: 327.8300 30/288 [==>...........................] - ETA: 166s - loss: 321.2423 31/288 [==>...........................] - ETA: 164s - loss: 315.2969 32/288 [==>...........................] - ETA: 162s - loss: 310.2537 33/288 [==>...........................] - ETA: 160s - loss: 304.6199 34/288 [==>...........................] - ETA: 159s - loss: 299.8316 35/288 [==>...........................] - ETA: 157s - loss: 297.6931 36/288 [==>...........................] - ETA: 156s - loss: 292.7713 37/288 [==>...........................] - ETA: 155s - loss: 290.1582 38/288 [==>...........................] - ETA: 154s - loss: 285.8716 39/288 [===>..........................] - ETA: 152s - loss: 281.9949 40/288 [===>..........................] - ETA: 151s - loss: 278.5289 41/288 [===>..........................] - ETA: 150s - loss: 275.9896 42/288 [===>..........................] - ETA: 148s - loss: 272.5021 43/288 [===>..........................] - ETA: 147s - loss: 269.2861 44/288 [===>..........................] - ETA: 146s - loss: 266.4091 45/288 [===>..........................] - ETA: 145s - loss: 264.7728 46/288 [===>..........................] - ETA: 144s - loss: 262.6936 47/288 [===>..........................] - ETA: 143s - loss: 260.9407 48/288 [====>.........................] - ETA: 142s - loss: 259.3025 49/288 [====>.........................] - ETA: 141s - loss: 257.2507 50/288 [====>.........................] - ETA: 140s - loss: 255.7525 51/288 [====>.........................] - ETA: 139s - loss: 254.1417 52/288 [====>.........................] - ETA: 138s - loss: 252.6085 53/288 [====>.........................] - ETA: 137s - loss: 251.6162 54/288 [====>.........................] - ETA: 136s - loss: 250.3618 55/288 [====>.........................] - ETA: 135s - loss: 249.9409 56/288 [====>.........................] - ETA: 134s - loss: 248.7968 57/288 [====>.........................] - ETA: 133s - loss: 247.7867 58/288 [=====>........................] - ETA: 132s - loss: 246.5979 59/288 [=====>........................] - ETA: 132s - loss: 245.5157 60/288 [=====>........................] - ETA: 131s - loss: 244.3972 61/288 [=====>........................] - ETA: 130s - loss: 243.2762 62/288 [=====>........................] - ETA: 129s - loss: 242.6062 63/288 [=====>........................] - ETA: 128s - loss: 241.3371 64/288 [=====>........................] - ETA: 127s - loss: 240.5564 65/288 [=====>........................] - ETA: 126s - loss: 238.8531 66/288 [=====>........................] - ETA: 126s - loss: 238.8982 67/288 [=====>........................] - ETA: 125s - loss: 238.1758 68/288 [======>.......................] - ETA: 124s - loss: 237.0459 69/288 [======>.......................] - ETA: 123s - loss: 236.2689 70/288 [======>.......................] - ETA: 123s - loss: 235.4738 71/288 [======>.......................] - ETA: 122s - loss: 234.8163 72/288 [======>.......................] - ETA: 121s - loss: 233.9026 73/288 [======>.......................] - ETA: 120s - loss: 233.0769 74/288 [======>.......................] - ETA: 120s - loss: 232.3312 75/288 [======>.......................] - ETA: 119s - loss: 232.2110 76/288 [======>.......................] - ETA: 118s - loss: 231.9291 77/288 [=======>......................] - ETA: 117s - loss: 230.7643 78/288 [=======>......................] - ETA: 117s - loss: 230.6509 79/288 [=======>......................] - ETA: 116s - loss: 229.3532 80/288 [=======>......................] - ETA: 115s - loss: 228.9057 81/288 [=======>......................] - ETA: 115s - loss: 228.1351 82/288 [=======>......................] - ETA: 114s - loss: 227.5273 83/288 [=======>......................] - ETA: 113s - loss: 226.5811 84/288 [=======>......................] - ETA: 113s - loss: 226.1852 85/288 [=======>......................] - ETA: 112s - loss: 225.1418 86/288 [=======>......................] - ETA: 112s - loss: 224.7699 87/288 [========>.....................] - ETA: 111s - loss: 223.8401 88/288 [========>.....................] - ETA: 110s - loss: 223.3562 89/288 [========>.....................] - ETA: 110s - loss: 222.5831 90/288 [========>.....................] - ETA: 109s - loss: 221.9694 91/288 [========>.....................] - ETA: 108s - loss: 221.1218 92/288 [========>.....................] - ETA: 107s - loss: 220.3752 93/288 [========>.....................] - ETA: 107s - loss: 219.5689 94/288 [========>.....................] - ETA: 106s - loss: 218.8291 95/288 [========>.....................] - ETA: 105s - loss: 218.0703 96/288 [=========>....................] - ETA: 105s - loss: 217.2730 97/288 [=========>....................] - ETA: 104s - loss: 216.6749 98/288 [=========>....................] - ETA: 104s - loss: 215.9154 99/288 [=========>....................] - ETA: 103s - loss: 215.2693100/288 [=========>....................] - ETA: 102s - loss: 214.6405101/288 [=========>....................] - ETA: 102s - loss: 213.9467102/288 [=========>....................] - ETA: 101s - loss: 213.3219103/288 [=========>....................] - ETA: 101s - loss: 212.6621104/288 [=========>....................] - ETA: 100s - loss: 212.0155105/288 [=========>....................] - ETA: 99s - loss: 211.3251 106/288 [==========>...................] - ETA: 99s - loss: 210.8215107/288 [==========>...................] - ETA: 98s - loss: 210.1741108/288 [==========>...................] - ETA: 97s - loss: 209.6492109/288 [==========>...................] - ETA: 97s - loss: 209.1162110/288 [==========>...................] - ETA: 96s - loss: 208.5961111/288 [==========>...................] - ETA: 96s - loss: 207.9993112/288 [==========>...................] - ETA: 95s - loss: 207.5308113/288 [==========>...................] - ETA: 94s - loss: 206.9602114/288 [==========>...................] - ETA: 94s - loss: 206.4221115/288 [==========>...................] - ETA: 93s - loss: 205.8722116/288 [===========>..................] - ETA: 93s - loss: 205.2948117/288 [===========>..................] - ETA: 92s - loss: 204.8164118/288 [===========>..................] - ETA: 92s - loss: 204.3158119/288 [===========>..................] - ETA: 91s - loss: 203.8080120/288 [===========>..................] - ETA: 90s - loss: 203.2703121/288 [===========>..................] - ETA: 90s - loss: 202.7460122/288 [===========>..................] - ETA: 89s - loss: 202.2754123/288 [===========>..................] - ETA: 89s - loss: 201.7964124/288 [===========>..................] - ETA: 88s - loss: 201.3780125/288 [============>.................] - ETA: 88s - loss: 200.9807126/288 [============>.................] - ETA: 87s - loss: 200.6101127/288 [============>.................] - ETA: 86s - loss: 200.1297128/288 [============>.................] - ETA: 86s - loss: 199.7573129/288 [============>.................] - ETA: 85s - loss: 199.3057130/288 [============>.................] - ETA: 85s - loss: 198.9478131/288 [============>.................] - ETA: 84s - loss: 198.4586132/288 [============>.................] - ETA: 84s - loss: 198.0146133/288 [============>.................] - ETA: 83s - loss: 197.5981134/288 [============>.................] - ETA: 82s - loss: 197.2907135/288 [=============>................] - ETA: 82s - loss: 196.8309136/288 [=============>................] - ETA: 81s - loss: 196.4057137/288 [=============>................] - ETA: 81s - loss: 196.0125138/288 [=============>................] - ETA: 80s - loss: 195.6669139/288 [=============>................] - ETA: 80s - loss: 195.3154140/288 [=============>................] - ETA: 79s - loss: 194.9742141/288 [=============>................] - ETA: 78s - loss: 194.6955142/288 [=============>................] - ETA: 78s - loss: 194.3244143/288 [=============>................] - ETA: 77s - loss: 194.0356144/288 [==============>...............] - ETA: 77s - loss: 193.6513145/288 [==============>...............] - ETA: 76s - loss: 193.3499146/288 [==============>...............] - ETA: 76s - loss: 192.9587147/288 [==============>...............] - ETA: 75s - loss: 192.6980148/288 [==============>...............] - ETA: 74s - loss: 192.3410149/288 [==============>...............] - ETA: 74s - loss: 192.0549150/288 [==============>...............] - ETA: 73s - loss: 191.8469151/288 [==============>...............] - ETA: 73s - loss: 191.5602152/288 [==============>...............] - ETA: 72s - loss: 191.3478153/288 [==============>...............] - ETA: 72s - loss: 191.0386154/288 [===============>..............] - ETA: 71s - loss: 190.8115155/288 [===============>..............] - ETA: 71s - loss: 190.5720156/288 [===============>..............] - ETA: 70s - loss: 190.2964157/288 [===============>..............] - ETA: 69s - loss: 190.0672158/288 [===============>..............] - ETA: 69s - loss: 189.8348159/288 [===============>..............] - ETA: 68s - loss: 189.5439160/288 [===============>..............] - ETA: 68s - loss: 189.3600161/288 [===============>..............] - ETA: 67s - loss: 189.0609162/288 [===============>..............] - ETA: 67s - loss: 188.8146163/288 [===============>..............] - ETA: 66s - loss: 188.6658164/288 [================>.............] - ETA: 66s - loss: 188.3687165/288 [================>.............] - ETA: 65s - loss: 188.1742166/288 [================>.............] - ETA: 65s - loss: 187.9717167/288 [================>.............] - ETA: 64s - loss: 187.7278168/288 [================>.............] - ETA: 64s - loss: 187.4595169/288 [================>.............] - ETA: 63s - loss: 187.2599170/288 [================>.............] - ETA: 62s - loss: 187.1020171/288 [================>.............] - ETA: 62s - loss: 186.8739172/288 [================>.............] - ETA: 61s - loss: 186.6867173/288 [=================>............] - ETA: 61s - loss: 186.4918174/288 [=================>............] - ETA: 60s - loss: 186.2061175/288 [=================>............] - ETA: 60s - loss: 185.9466176/288 [=================>............] - ETA: 59s - loss: 185.7153177/288 [=================>............] - ETA: 59s - loss: 185.4656178/288 [=================>............] - ETA: 58s - loss: 185.3567179/288 [=================>............] - ETA: 58s - loss: 185.1382180/288 [=================>............] - ETA: 57s - loss: 184.9021181/288 [=================>............] - ETA: 56s - loss: 184.6885182/288 [=================>............] - ETA: 56s - loss: 184.4949183/288 [==================>...........] - ETA: 55s - loss: 184.3491184/288 [==================>...........] - ETA: 55s - loss: 184.1691185/288 [==================>...........] - ETA: 54s - loss: 183.9589186/288 [==================>...........] - ETA: 54s - loss: 183.8215187/288 [==================>...........] - ETA: 53s - loss: 183.6746188/288 [==================>...........] - ETA: 53s - loss: 183.4595189/288 [==================>...........] - ETA: 52s - loss: 183.3548190/288 [==================>...........] - ETA: 52s - loss: 183.1251191/288 [==================>...........] - ETA: 51s - loss: 182.9515192/288 [===================>..........] - ETA: 50s - loss: 182.7623193/288 [===================>..........] - ETA: 50s - loss: 182.5978194/288 [===================>..........] - ETA: 49s - loss: 182.5033195/288 [===================>..........] - ETA: 49s - loss: 182.3676196/288 [===================>..........] - ETA: 48s - loss: 182.2313197/288 [===================>..........] - ETA: 48s - loss: 182.0727198/288 [===================>..........] - ETA: 47s - loss: 181.8878199/288 [===================>..........] - ETA: 47s - loss: 181.7384200/288 [===================>..........] - ETA: 46s - loss: 181.6322201/288 [===================>..........] - ETA: 46s - loss: 181.5057202/288 [====================>.........] - ETA: 45s - loss: 181.4465203/288 [====================>.........] - ETA: 45s - loss: 181.3228204/288 [====================>.........] - ETA: 44s - loss: 181.1853205/288 [====================>.........] - ETA: 43s - loss: 181.0394206/288 [====================>.........] - ETA: 43s - loss: 181.0014207/288 [====================>.........] - ETA: 42s - loss: 180.9151208/288 [====================>.........] - ETA: 42s - loss: 180.8207209/288 [====================>.........] - ETA: 41s - loss: 180.7268210/288 [====================>.........] - ETA: 41s - loss: 180.6168211/288 [====================>.........] - ETA: 40s - loss: 180.5466212/288 [=====================>........] - ETA: 40s - loss: 180.5031213/288 [=====================>........] - ETA: 39s - loss: 180.4451214/288 [=====================>........] - ETA: 39s - loss: 180.3355215/288 [=====================>........] - ETA: 38s - loss: 180.2691216/288 [=====================>........] - ETA: 38s - loss: 180.2544217/288 [=====================>........] - ETA: 37s - loss: 180.1749218/288 [=====================>........] - ETA: 36s - loss: 180.1916219/288 [=====================>........] - ETA: 36s - loss: 180.1535220/288 [=====================>........] - ETA: 35s - loss: 180.1015221/288 [======================>.......] - ETA: 35s - loss: 180.0457222/288 [======================>.......] - ETA: 34s - loss: 180.0370223/288 [======================>.......] - ETA: 34s - loss: 179.9807224/288 [======================>.......] - ETA: 33s - loss: 179.9860225/288 [======================>.......] - ETA: 33s - loss: 179.9627226/288 [======================>.......] - ETA: 32s - loss: 179.9460227/288 [======================>.......] - ETA: 32s - loss: 179.9206228/288 [======================>.......] - ETA: 31s - loss: 179.8903229/288 [======================>.......] - ETA: 31s - loss: 179.9190230/288 [======================>.......] - ETA: 30s - loss: 179.9597231/288 [=======================>......] - ETA: 30s - loss: 179.9606232/288 [=======================>......] - ETA: 29s - loss: 180.0080233/288 [=======================>......] - ETA: 28s - loss: 180.0599234/288 [=======================>......] - ETA: 28s - loss: 180.1182235/288 [=======================>......] - ETA: 27s - loss: 180.1715236/288 [=======================>......] - ETA: 27s - loss: 180.1608237/288 [=======================>......] - ETA: 26s - loss: 180.1168238/288 [=======================>......] - ETA: 26s - loss: 180.0707239/288 [=======================>......] - ETA: 25s - loss: 180.1152240/288 [========================>.....] - ETA: 25s - loss: 180.0953241/288 [========================>.....] - ETA: 24s - loss: 180.2164242/288 [========================>.....] - ETA: 24s - loss: 180.2465243/288 [========================>.....] - ETA: 23s - loss: 180.3237244/288 [========================>.....] - ETA: 23s - loss: 180.4225245/288 [========================>.....] - ETA: 22s - loss: 180.4393246/288 [========================>.....] - ETA: 22s - loss: 180.4598247/288 [========================>.....] - ETA: 21s - loss: 180.5168248/288 [========================>.....] - ETA: 21s - loss: 180.5614249/288 [========================>.....] - ETA: 20s - loss: 180.6043250/288 [=========================>....] - ETA: 19s - loss: 180.6640251/288 [=========================>....] - ETA: 19s - loss: 180.7484252/288 [=========================>....] - ETA: 18s - loss: 180.7778253/288 [=========================>....] - ETA: 18s - loss: 180.8663254/288 [=========================>....] - ETA: 17s - loss: 180.9710255/288 [=========================>....] - ETA: 17s - loss: 181.0102256/288 [=========================>....] - ETA: 16s - loss: 181.0437257/288 [=========================>....] - ETA: 16s - loss: 181.2018258/288 [=========================>....] - ETA: 15s - loss: 181.2956259/288 [=========================>....] - ETA: 15s - loss: 181.4900260/288 [==========================>...] - ETA: 14s - loss: 181.5847261/288 [==========================>...] - ETA: 14s - loss: 181.7403262/288 [==========================>...] - ETA: 13s - loss: 181.9056263/288 [==========================>...] - ETA: 13s - loss: 181.9682264/288 [==========================>...] - ETA: 12s - loss: 182.1013265/288 [==========================>...] - ETA: 12s - loss: 182.2479266/288 [==========================>...] - ETA: 11s - loss: 182.3802267/288 [==========================>...] - ETA: 11s - loss: 182.5143268/288 [==========================>...] - ETA: 10s - loss: 182.6108269/288 [===========================>..] - ETA: 9s - loss: 182.7001 270/288 [===========================>..] - ETA: 9s - loss: 182.7686271/288 [===========================>..] - ETA: 8s - loss: 182.9440272/288 [===========================>..] - ETA: 8s - loss: 183.0106273/288 [===========================>..] - ETA: 7s - loss: 183.1526274/288 [===========================>..] - ETA: 7s - loss: 183.2735275/288 [===========================>..] - ETA: 6s - loss: 183.4369276/288 [===========================>..] - ETA: 6s - loss: 183.5799277/288 [===========================>..] - ETA: 5s - loss: 183.7139278/288 [===========================>..] - ETA: 5s - loss: 183.8468279/288 [============================>.] - ETA: 4s - loss: 184.0082280/288 [============================>.] - ETA: 4s - loss: 184.1515281/288 [============================>.] - ETA: 3s - loss: 184.3057282/288 [============================>.] - ETA: 3s - loss: 184.4490283/288 [============================>.] - ETA: 2s - loss: 184.5870284/288 [============================>.] - ETA: 2s - loss: 184.7162285/288 [============================>.] - ETA: 1s - loss: 184.8696286/288 [============================>.] - ETA: 1s - loss: 184.9580287/288 [============================>.] - ETA: 0s - loss: 185.14423 minutes and 26 seconds elapsed.
ending script
