{"class_name": "Model", "keras_version": "2.0.4", "config": {"layers": [{"class_name": "InputLayer", "config": {"dtype": "float32", "batch_input_shape": [null, null, 26], "name": "the_input", "sparse": false}, "inbound_nodes": [], "name": "the_input"}, {"class_name": "Dropout", "config": {"rate": 0.2, "trainable": true, "name": "dropout_1"}, "inbound_nodes": [[["the_input", 0, 0, {}]]], "name": "dropout_1"}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "fc1", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 2048, "use_bias": true, "activity_regularizer": null}, "inbound_nodes": [[["dropout_1", 0, 0, {}]]], "name": "fc1"}, {"class_name": "Dropout", "config": {"rate": 0.5, "trainable": true, "name": "dropout_2"}, "inbound_nodes": [[["fc1", 0, 0, {}]]], "name": "dropout_2"}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "fc2", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 2048, "use_bias": true, "activity_regularizer": null}, "inbound_nodes": [[["dropout_2", 0, 0, {}]]], "name": "fc2"}, {"class_name": "Dropout", "config": {"rate": 0.5, "trainable": true, "name": "dropout_3"}, "inbound_nodes": [[["fc2", 0, 0, {}]]], "name": "dropout_3"}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "fc3", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 2048, "use_bias": true, "activity_regularizer": null}, "inbound_nodes": [[["dropout_3", 0, 0, {}]]], "name": "fc3"}, {"class_name": "Dropout", "config": {"rate": 0.5, "trainable": true, "name": "dropout_4"}, "inbound_nodes": [[["fc3", 0, 0, {}]]], "name": "dropout_4"}, {"class_name": "SimpleRNN", "config": {"trainable": true, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "use_bias": true, "bias_regularizer": null, "implementation": 0, "unroll": false, "activation": "tanh", "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 512, "dropout": 0.0, "recurrent_dropout": 0.0, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "scale": 2.0, "seed": null, "mode": "fan_in"}}, "kernel_constraint": null, "activity_regularizer": null, "stateful": false, "recurrent_regularizer": null, "name": "rnn_f", "bias_constraint": null, "go_backwards": false, "kernel_regularizer": null, "return_sequences": true, "recurrent_constraint": null}, "inbound_nodes": [[["dropout_4", 0, 0, {}]]], "name": "rnn_f"}, {"class_name": "SimpleRNN", "config": {"trainable": true, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "use_bias": true, "bias_regularizer": null, "implementation": 0, "unroll": false, "activation": "tanh", "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 512, "dropout": 0.0, "recurrent_dropout": 0.0, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "scale": 2.0, "seed": null, "mode": "fan_in"}}, "kernel_constraint": null, "activity_regularizer": null, "stateful": false, "recurrent_regularizer": null, "name": "rnn_b", "bias_constraint": null, "go_backwards": true, "kernel_regularizer": null, "return_sequences": true, "recurrent_constraint": null}, "inbound_nodes": [[["dropout_4", 0, 0, {}]]], "name": "rnn_b"}, {"class_name": "Add", "config": {"trainable": true, "name": "add_1"}, "inbound_nodes": [[["rnn_f", 0, 0, {}], ["rnn_b", 0, 0, {}]]], "name": "add_1"}, {"class_name": "Dropout", "config": {"rate": 0.3, "trainable": true, "name": "dropout_5"}, "inbound_nodes": [[["add_1", 0, 0, {}]]], "name": "dropout_5"}, {"class_name": "TimeDistributed", "config": {"layer": {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "y_pred", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "softmax", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 30, "use_bias": true, "activity_regularizer": null}}, "trainable": true, "name": "time_distributed_1"}, "inbound_nodes": [[["dropout_5", 0, 0, {}]]], "name": "time_distributed_1"}, {"class_name": "InputLayer", "config": {"dtype": "float32", "batch_input_shape": [null, null], "name": "the_labels", "sparse": false}, "inbound_nodes": [], "name": "the_labels"}, {"class_name": "InputLayer", "config": {"dtype": "int64", "batch_input_shape": [null, 1], "name": "input_length", "sparse": false}, "inbound_nodes": [], "name": "input_length"}, {"class_name": "InputLayer", "config": {"dtype": "int64", "batch_input_shape": [null, 1], "name": "label_length", "sparse": false}, "inbound_nodes": [], "name": "label_length"}, {"class_name": "Lambda", "config": {"function": ["c\u0001\u0000\u0000\u0000\u0005\u0000\u0000\u0000\u0005\u0000\u0000\u0000C\u0000\u0000\u0000se\u0000\u0000\u0000|\u0000\u0000\\\u0004\u0000}\u0001\u0000}\u0002\u0000}\u0003\u0000}\u0004\u0000d\u0001\u0000GHd\u0002\u0000|\u0001\u0000j\u0000\u0000f\u0002\u0000GHd\u0003\u0000|\u0002\u0000j\u0000\u0000f\u0002\u0000GHd\u0004\u0000|\u0003\u0000j\u0000\u0000f\u0002\u0000GHd\u0005\u0000|\u0004\u0000j\u0000\u0000f\u0002\u0000GHt\u0001\u0000j\u0002\u0000|\u0002\u0000|\u0001\u0000|\u0003\u0000|\u0004\u0000\u0083\u0004\u0000S(\u0006\u0000\u0000\u0000Ns\u0019\u0000\u0000\u0000CTC lambda inputs / shapes\u0007\u0000\u0000\u0000y_pred:s\u0007\u0000\u0000\u0000labels:s\r\u0000\u0000\u0000input_length:s\r\u0000\u0000\u0000label_length:(\u0003\u0000\u0000\u0000t\u0005\u0000\u0000\u0000shapet\u0001\u0000\u0000\u0000Kt\u000e\u0000\u0000\u0000ctc_batch_cost(\u0005\u0000\u0000\u0000t\u0004\u0000\u0000\u0000argst\u0006\u0000\u0000\u0000y_predt\u0006\u0000\u0000\u0000labelst\f\u0000\u0000\u0000input_lengtht\f\u0000\u0000\u0000label_length(\u0000\u0000\u0000\u0000(\u0000\u0000\u0000\u0000s1\u0000\u0000\u0000/home/rob/Dropbox/UCL/DIS/apple-test/kDS/model.pyt\u000f\u0000\u0000\u0000ctc_lambda_func\u0016\u0000\u0000\u0000s\u000e\u0000\u0000\u0000\u0000\u0001\u0012\u0006\u0005\u0001\u000e\u0001\u000e\u0001\u000e\u0001\u000e\u0003", null, null], "name": "ctc", "trainable": true, "function_type": "lambda", "arguments": {}, "output_shape": [1], "output_shape_type": "raw"}, "inbound_nodes": [[["time_distributed_1", 0, 0, {}], ["the_labels", 0, 0, {}], ["input_length", 0, 0, {}], ["label_length", 0, 0, {}]]], "name": "ctc"}], "input_layers": [["the_input", 0, 0], ["the_labels", 0, 0], ["input_length", 0, 0], ["label_length", 0, 0]], "output_layers": [["ctc", 0, 0]], "name": "model_1"}, "backend": "tensorflow"}