0
test script test-tf
Device mapping:
/job:localhost/replica:0/task:0/gpu:0 -> device: 0, name: Tesla P100-PCIE-16GB, pci bus id: 0000:02:00.0
MatMul: (MatMul): /job:localhost/replica:0/task:0/gpu:0
b: (Const): /job:localhost/replica:0/task:0/gpu:0
a: (Const): /job:localhost/replica:0/task:0/gpu:0
[[ 22.  28.]
 [ 49.  64.]]
starting kDS script
2.0.4
6300
(4620, 840, 840)
('max_trans_charlength:', 80)
('Words:', 54198)
('Vocab:', 6145)
80
30
(?, 80)
(?, 778, 30)
(?, 1)
(?, 1)
________________________________________________________________________________
Layer (type)              Output Shape      Param #  Connected to               
================================================================================
the_input (InputLayer)    (None, 778, 26)   0                                   
________________________________________________________________________________
fc1 (Dense)               (None, 778, 2048) 55296    the_input[0][0]            
________________________________________________________________________________
fc2 (Dense)               (None, 778, 2048) 4196352  fc1[0][0]                  
________________________________________________________________________________
fc3 (Dense)               (None, 778, 2048) 4196352  fc2[0][0]                  
________________________________________________________________________________
rnn_f (SimpleRNN)         (None, 778, 512)  1311232  fc3[0][0]                  
________________________________________________________________________________
rnn_b (SimpleRNN)         (None, 778, 512)  1311232  fc3[0][0]                  
________________________________________________________________________________
concatenate_1 (Concatenat (None, 778, 1024) 0        rnn_f[0][0]                
                                                     rnn_b[0][0]                
________________________________________________________________________________
time_distributed_1 (TimeD (None, 778, 30)   30750    concatenate_1[0][0]        
________________________________________________________________________________
the_labels (InputLayer)   (None, 80)        0                                   
________________________________________________________________________________
input_length (InputLayer) (None, 1)         0                                   
________________________________________________________________________________
label_length (InputLayer) (None, 1)         0                                   
________________________________________________________________________________
ctc (Lambda)              (None, 1)         0        time_distributed_1[0][0]   
                                                     the_labels[0][0]           
                                                     input_length[0][0]         
                                                     label_length[0][0]         
================================================================================
Total params: 11,101,214
Trainable params: 11,101,214
Non-trainable params: 0
________________________________________________________________________________
None
(288, 26)
Epoch 1/100
0 minutes and 22 seconds elapsed.
ending script
